#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/morrislan/morrislan/runs/run-ta7YvaAENP9y9dWF

Waiting for the plan to start...

Terraform v1.6.4
on linux_amd64
Initializing plugins and modules...
module.cloudflare-zerotrust.cloudflare_access_identity_provider.github: Refreshing state... [id=1409e900-d84a-4ea3-9556-544687bd451d]
module.cloudflare-zerotrust.cloudflare_access_identity_provider.otp: Refreshing state... [id=105e6c62-5f48-4570-88c2-b52d3fb92f6f]
module.cloudflare-zerotrust.module.access_app_status.cloudflare_access_application.application: Refreshing state... [id=4fe0b49f-306e-486d-9e6b-38d75ee3fd6b]
module.cloudflare-zerotrust.module.access_app_homeradmin.cloudflare_access_application.application: Refreshing state... [id=68b88b86-d089-4b1e-b95e-3a91009d5977]
module.cloudflare-zerotrust.module.access_app_clancyadmin.cloudflare_access_application.application: Refreshing state... [id=cee2cf44-db6c-485a-a8b6-e771ffd5e737]
module.cloudflare-zerotrust.module.access_app_unifi.cloudflare_access_application.application: Refreshing state... [id=e2b5cb14-5c46-4760-95d9-1d5098cd1adb]
module.cloudflare-zerotrust.module.access_app_ha.cloudflare_access_application.application: Refreshing state... [id=a1a38678-76df-4622-a68d-7635cf07cb17]
module.cloudflare-zerotrust.module.access_app_status.cloudflare_access_policy.github_policy: Refreshing state... [id=6abfba43-28de-440f-9fad-ea4ebfef906e]
module.cloudflare-zerotrust.module.access_app_homeradmin.cloudflare_access_policy.github_policy: Refreshing state... [id=f901f69f-e58a-4988-a09e-0c6da6a1a13b]
module.cloudflare-zerotrust.module.access_app_clancyadmin.cloudflare_access_policy.github_policy: Refreshing state... [id=4671bdf1-7ce1-4e07-9390-1b7ea68af61c]
module.cloudflare-zerotrust.module.access_app_unifi.cloudflare_access_policy.github_policy: Refreshing state... [id=beed2fef-0690-46dd-9d8d-19ea00eb2ed3]
module.cloudflare-zerotrust.module.access_app_ha.cloudflare_access_policy.github_policy: Refreshing state... [id=51605697-0853-4c6b-8d06-07bbdd5459d2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloudflare-zerotrust.cloudflare_record.access_app_clancyadmin will be created
  + resource "cloudflare_record" "access_app_clancyadmin" {
      + allow_overwrite = true
      + comment         = "CNAME to Clancy ZT Tunnel for Clancy Admin"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "clancyadmin.morrislan.net"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "8eaa1d30ab4bcae4d54f9ac6886ae26b"
    }

  # module.cloudflare-zerotrust.cloudflare_record.access_app_ha will be created
  + resource "cloudflare_record" "access_app_ha" {
      + allow_overwrite = true
      + comment         = "CNAME to Clancy ZT Tunnel for Home Assistant"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "ha.morrislan.net"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "8eaa1d30ab4bcae4d54f9ac6886ae26b"
    }

  # module.cloudflare-zerotrust.cloudflare_record.access_app_homeradmin will be created
  + resource "cloudflare_record" "access_app_homeradmin" {
      + allow_overwrite = true
      + comment         = "CNAME to Clancy ZT Tunnel for Homer Admin"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "homeradmin.morrislan.net"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "8eaa1d30ab4bcae4d54f9ac6886ae26b"
    }

  # module.cloudflare-zerotrust.cloudflare_record.access_app_status will be created
  + resource "cloudflare_record" "access_app_status" {
      + allow_overwrite = true
      + comment         = "CNAME to Clancy ZT Tunnel for Network Status page"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "status.morrislan.net"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "8eaa1d30ab4bcae4d54f9ac6886ae26b"
    }

  # module.cloudflare-zerotrust.cloudflare_record.access_app_unifi will be created
  + resource "cloudflare_record" "access_app_unifi" {
      + allow_overwrite = true
      + comment         = "CNAME to Clancy ZT Tunnel for UniFi Controller"
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "unifi.morrislan.net"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = (known after apply)
      + zone_id         = "8eaa1d30ab4bcae4d54f9ac6886ae26b"
    }

  # module.cloudflare-zerotrust.cloudflare_tunnel.clancy will be created
  + resource "cloudflare_tunnel" "clancy" {
      + account_id   = (sensitive value)
      + cname        = (known after apply)
      + config_src   = "cloudflare"
      + id           = (known after apply)
      + name         = "clancy.morrislan.net"
      + secret       = (sensitive value)
      + tunnel_token = (sensitive value)
    }

  # module.cloudflare-zerotrust.cloudflare_tunnel_config.clancy will be created
  + resource "cloudflare_tunnel_config" "clancy" {
      + account_id = (sensitive value)
      + id         = (known after apply)
      + tunnel_id  = (known after apply)

      + config {
          + ingress_rule {
              + hostname = "status.morrislan.net"
              + service  = "http://marge.morrislan.net:3001"

              + origin_request {
                  + connect_timeout          = "2m0s"
                  + disable_chunked_encoding = false
                  + http2_origin             = false
                  + keep_alive_connections   = 100
                  + keep_alive_timeout       = "1m30s"
                  + no_happy_eyeballs        = false
                  + no_tls_verify            = true
                  + proxy_address            = "127.0.0.1"
                  + proxy_port               = 0
                  + tcp_keep_alive           = "30s"
                  + tls_timeout              = "10s"
                }
            }
          + ingress_rule {
              + hostname = "ha.morrislan.net"
              + service  = "https://ha.morrislan.net"

              + origin_request {
                  + connect_timeout          = "2m0s"
                  + disable_chunked_encoding = false
                  + http2_origin             = false
                  + keep_alive_connections   = 100
                  + keep_alive_timeout       = "1m30s"
                  + no_happy_eyeballs        = false
                  + no_tls_verify            = false
                  + proxy_address            = "127.0.0.1"
                  + proxy_port               = 0
                  + tcp_keep_alive           = "30s"
                  + tls_timeout              = "10s"
                }
            }
          + ingress_rule {
              + hostname = "unifi.morrislan.net"
              + service  = "https://marge.morrislan.net:8443"

              + origin_request {
                  + connect_timeout          = "2m0s"
                  + disable_chunked_encoding = false
                  + http2_origin             = false
                  + keep_alive_connections   = 100
                  + keep_alive_timeout       = "1m30s"
                  + no_happy_eyeballs        = false
                  + no_tls_verify            = true
                  + proxy_address            = "127.0.0.1"
                  + proxy_port               = 0
                  + tcp_keep_alive           = "30s"
                  + tls_timeout              = "10s"
                }
            }
          + ingress_rule {
              + hostname = "clancyadmin.morrislan.net"
              + service  = "https://clancy.morrislan.net:2053"

              + origin_request {
                  + connect_timeout          = "2m0s"
                  + disable_chunked_encoding = false
                  + http2_origin             = false
                  + keep_alive_connections   = 100
                  + keep_alive_timeout       = "1m30s"
                  + no_happy_eyeballs        = false
                  + no_tls_verify            = true
                  + proxy_address            = "127.0.0.1"
                  + proxy_port               = 0
                  + tcp_keep_alive           = "30s"
                  + tls_timeout              = "10s"
                }
            }
          + ingress_rule {
              + hostname = "homeradmin.morrislan.net"
              + service  = "https://homer.morrislan.net:2053"

              + origin_request {
                  + connect_timeout          = "2m0s"
                  + disable_chunked_encoding = false
                  + http2_origin             = false
                  + keep_alive_connections   = 100
                  + keep_alive_timeout       = "1m30s"
                  + no_happy_eyeballs        = false
                  + no_tls_verify            = true
                  + proxy_address            = "127.0.0.1"
                  + proxy_port               = 0
                  + tcp_keep_alive           = "30s"
                  + tls_timeout              = "10s"
                }
            }
          + ingress_rule {
              + service = "http_status:404"
            }
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 19 estimated
           $0.0/mo +$0.0

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @m4xmorris, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*